package lesson06;
/* 1. Напишите программу действий кассира магазина. У
него пытаются купить алкоголь следующие 5 покупателей:
10 лет, 17 лет, 18 лет, 20 лет и 30 лет.
 */

//public class HomeWork06Switch {
  //  public static void main(String[] args) {
  //      System.out.println(salesPermission());


      //  public static String salesPermission ( int age){
         //   String result = "";
           // switch (custumerAge) {
          //      case 10:
           //         result = "Продажа алкоголя запрещена";
           //         break;
            //    case 17:
             //       result = "Продажа легкого алкоголя разрешена";
           //         break;
          //      case 18:
             //       result = "Все, кроме водки, купить можно";
           //         break;
            //    case 20:
             //   case 30:
                //    result = "Продажа алкоголя разрешена";
              //      break;
            //    default:
               //     result = "Зовем администратора";
             //       break;
         //   }
        //    return result;
  //      }


 //   }
